#include <iostream>
using namespace std;
/*在处理printf时，压栈顺序为从右往左，也就是说从右往左的计算（“计算”不等于“输出”）。
　　a++和++a的压栈的区别：在计算时，遇到a++会记录此时的a的值作为最后的输出结果。
  遇到a和++a的时候则不会将此时的计算结果作为最终的输出，只会修改a的值，
  在最终输出的时候都输出a的值（所以++a和a的结果总是一样的）。*/
int main()
{
	int a=0, b=7;
	//一下代码均为单独运行时的的输出结果
	//cout<<++a<<++a<<++a;//333
	//cout<<++a<<++a<<a;//222
	//cout<<++a<<a<<a;//111
	//cout<<a<<a<<a;//000
	//cout<<a++<<a<<a;//011
	//cout<<a++<<a++<<a;//102
	//cout<<a++<<a++<<a++;//210

	//cout<<a<<b<<++a<<++b;//1818
	//cout<<a<<b<<a++<<b++;//1807
	//cout<<++a<<++b<<a<<b;//1818
	cout<<a++<<b++<<a<<b;//0718
	system("pause");
	return 0;
}